src/cf/Documents/GDS_НеисправныеДУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_НеисправныеДУТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.GDS_КоличествоДУТ</xr:Item>
				<xr:Item>InformationRegister.GDS_НеисправныеДУТ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьСведенияОДУТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследниеДанные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS6</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS7</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LLS8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнееМестоположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НуждаетсяВРемонте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаетНеСтабильно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/GDS_КоличествоДУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_КоличествоДУТ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДУТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_НеисправныеДУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_НеисправныеДУТ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеДанные</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LLS8</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееМестоположение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаетНеСтабильно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НуждаетсяВРемонте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаписыватьСведенияОДУТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/GDS_НеисправныеДУТ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.АвторизованныйПользователь;
		Объект.Организация	 = Справочники.Организации.НайтиПоНаименованию("АО ""СП""", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтЗагрузить(Команда)

	Объект.ТЧ.Очистить();
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите имя файла для чтения";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл MS Excel (.xlsx)| *.xlsx";
	
	Если Не Диалог.Выбрать() Тогда
		Сообщить("Файл для обработки не выбран!");
	Иначе
		ФайлДанных = Диалог.ПолноеИмяФайла;
		
		Попытка
			Excel = Новый COMОбъект("Excel.Application");
			Excel.WorkBooks.Open(ФайлДанных);
			Состояние("Обработка файла Microsoft Excel...");
		Исключение
			Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		Excel.Sheets(1).Select(); // лист 1, по умолчанию
	Исключение
		Excel.ActiveWorkbook.Close();
		Excel = 0;
		Сообщить("Файл " + Строка(ФайлДанных) + " не соответствует необходимому формату! Первый лист не найден!");
		Возврат;
	КонецПопытки;
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	
	Если Версия = "8" Тогда
		ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	КонецЕсли;
	
	Машина = "";
	
	Для Сч = 6 По ФайлСтрок Цикл
		Состояние("Обрабатывается строка " + Строка(Сч) + " из " + Строка(ФайлСтрок));	
		
		Если НЕ СокрЛП(Excel.Cells(Сч, 1).Value) = "" Тогда
			ТС = ВернутьМашину(СокрЛП(Excel.Cells(Сч, 4).Value));
			
			НоваяСтрока = Объект.ТЧ.Добавить();
			
			НоваяСтрока.ТС = ТС;
			НоваяСтрока.НомерТС = СокрЛП(Excel.Cells(Сч, 4).Value);
			НоваяСтрока.СерийныйНомер = СокрЛП(Excel.Cells(Сч, 5).Value);
			НоваяСтрока.ПоследниеДанные = СокрЛП(Excel.Cells(Сч, 6).Value);
			НоваяСтрока.ОстатокТоплива = СокрЛП(Excel.Cells(Сч, 7).Value);
			НКоличествоДУТ = 0;
			
			Если СокрЛП(Excel.Cells(Сч, 8).Value) = "Подключен" Тогда
				НоваяСтрока.LLS1 = Истина;
				НКоличествоДУТ = 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 9).Value) = "Подключен" Тогда
				НоваяСтрока.LLS2 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 10).Value) = "Подключен" Тогда
				НоваяСтрока.LLS3 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 12).Value) = "Подключен" Тогда
				НоваяСтрока.LLS4 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 13).Value) = "Подключен" Тогда
				НоваяСтрока.LLS5 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 14).Value) = "Подключен" Тогда
				НоваяСтрока.LLS6 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 15).Value) = "Подключен" Тогда
				НоваяСтрока.LLS7 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			Если СокрЛП(Excel.Cells(Сч, 16).Value) = "Подключен" Тогда
				НоваяСтрока.LLS8 = Истина;
				НКоличествоДУТ = НКоличествоДУТ + 1;
			КонецЕсли;
			
			НоваяСтрока.ПоследнееМестоположение = СокрЛП(Excel.Cells(Сч, 17).Value);
				
			Если Не УчитыватьТС(ТС) Тогда
				НоваяСтрока.НеУчитывать = Истина;
			Иначе
				НоваяСтрока.НуждаетсяВРемонте = ПроверитьНеобходимостьРемонта(ТС, НоваяСтрока.НомерТС, НКоличествоДУТ, НоваяСтрока.ПоследниеДанные);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
		
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите имя файла для чтения";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл MS Excel (.xlsx)| *.xlsx";
	
	Если Не Диалог.Выбрать() Тогда
		Сообщить("Файл для обработки не выбран!");
	Иначе
		ИмяФайла = Диалог.ПолноеИмяФайла;
		Файл = Новый ДвоичныеДанные(ИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
		Объект.ТЧ.Очистить();
		ЗагрузитьНаСервере(Адрес);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ФайлВХранилище)

	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлВХранилище);
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ПутьФайла = КаталогВременныхФайлов() + "123.xlsx"; //для примера...
		ДвоичныеДанные.Записать(ПутьФайла);	
		ТабДок.Прочитать(ПутьФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		УдалитьФайлы(ПутьФайла);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	//Определяем количество строк
	КолСтр = ТабДок.ВысотаТаблицы;
	
	Для Сч = 6 по КолСтр Цикл
		Попытка
			Если НЕ Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст) = "" Тогда
				ТС = ВернутьМашину(СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст)));
				
				НоваяСтрока = Объект.ТЧ.Добавить();
				
				НоваяСтрока.ТС = ТС;
				НоваяСтрока.НомерТС = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст));
				НоваяСтрока.СерийныйНомер = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 5).ТекущаяОбласть.Текст));
				
				//СтрДата = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст));
				//СтрДата = Лев(СтрДата,СтрДлина(СтрДата)-3);  
				//М = СтрНайти(СтрДата,"/");
				//Мес = Лев(СтрДата,М-1);
				//Д = Прав(СтрДата,СтрДлина(СтрДата)-М);
				//Ден1 = СтрНайти(Д,"/");
				//Ден2 = Лев(Д,Ден1-1);
				//Ден3 = Прав(Д,СтрДлина(Д)-Ден1);
				
				НоваяСтрока.ПоследниеДанные = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст));//Ден2+"."+Мес+"."+Ден3; 
				НоваяСтрока.ОстатокТоплива = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст));
				НКоличествоДУТ = 0;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 8).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS1 = Истина;
					НКоличествоДУТ = 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 8).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS1 = Истина;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 9).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS2 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 9).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS2 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS3 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS3 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS4 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS4 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS5 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS5 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS6 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 14).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS6 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS7 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 15).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS7 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				Если СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 16).ТекущаяОбласть.Текст)) = "Подключен" Тогда
					НоваяСтрока.LLS8 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
				ИначеЕсли СтрНайти(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 16).ТекущаяОбласть.Текст), "Были отключения") >0 Тогда
					НоваяСтрока.LLS8 = Истина;
					НКоличествоДУТ = НКоличествоДУТ + 1;
					НоваяСтрока.РаботаетНеСтабильно = Истина;
				КонецЕсли;
				
				НоваяСтрока.ПоследнееМестоположение = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + 17).ТекущаяОбласть.Текст));
				
				Если Не УчитыватьТС(ТС) Тогда
					НоваяСтрока.НеУчитывать = Истина;
				Иначе
					НоваяСтрока.НуждаетсяВРемонте = ПроверитьНеобходимостьРемонта(ТС, НоваяСтрока.НомерТС, НКоличествоДУТ, НоваяСтрока.ПоследниеДанные);
				КонецЕсли;
				
				Комментарий = Комментарий(ТС);
				
				Если ЗначениеЗаполнено (Комментарий) Тогда
					НоваяСтрока.Комментарий = Комментарий;
				КонецЕсли;	
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось загрузить строку "+Строка(Сч);
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьНеобходимостьРемонта(ТС, НомерТС, НКоличествоДУТ, ПоследниеДанные)

	НуженРемонт = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_КоличествоДУТСрезПоследних.ТС,
		|	GDS_КоличествоДУТСрезПоследних.НомерТС,
		|	GDS_КоличествоДУТСрезПоследних.КоличествоДУТ
		|ИЗ
		|	РегистрСведений.GDS_КоличествоДУТ.СрезПоследних(&НаДату, ) КАК GDS_КоличествоДУТСрезПоследних
		|ГДЕ
		|	GDS_КоличествоДУТСрезПоследних.ТС = &ТС
		|	И GDS_КоличествоДУТСрезПоследних.НомерТС = &НомерТС";
	
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("НомерТС", НомерТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоДУТ > НКоличествоДУТ Тогда
			НуженРемонт = Истина;
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоДУТ < НКоличествоДУТ Тогда
			НуженРемонт = Ложь;	
		КонецЕсли;			
	КонецЦикла;
	
	Если ПоследниеДанные <> "Нет данных за выбранный период" Тогда
		Если Объект.Дата - 86400 > Дата(ПоследниеДанные) Тогда
			НуженРемонт = Истина;
		КонецЕсли;
	Иначе
		НуженРемонт = Истина;
	КонецЕсли;
	
	Возврат НуженРемонт;

	
КонецФункции

Функция УчитыватьТС(ТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_НеисправныеДУТСрезПоследних.НеУчитывать
		|ИЗ
		|	РегистрСведений.GDS_НеисправныеДУТ.СрезПоследних(
		|			,
		|			ТС = &ТС
		|				И ЗаписыватьСведенияОДУТ = ИСТИНА) КАК GDS_НеисправныеДУТСрезПоследних";
	
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.НеУчитывать Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ВернутьМашину(ТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатТС КАК уатТС
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА СТРНАЙТИ(уатТС.ГосударственныйНомер, ""g-"") >= 1
	               |				ТОГДА СТРЗАМЕНИТЬ(уатТС.ГосударственныйНомер, ""g-"", """") = &ГосНомер
	               |			ИНАЧЕ уатТС.ГосударственныйНомер = &ГосНомер
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ГосНомер", ТС);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.уатТС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция Комментарий(ТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_НеисправныеДУТСрезПоследних.Комментарий
		|ИЗ
		|	РегистрСведений.GDS_НеисправныеДУТ.СрезПоследних(
		|			,
		|			ТС = &ТС
		|				И ЗаписыватьСведенияОДУТ = ИСТИНА) КАК GDS_НеисправныеДУТСрезПоследних";
	
	Запрос.УстановитьПараметр("ТС", ТС);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Комментарий;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
